import React, { useState } from 'react';
import styles from './FAQ.module.css';

const FAQ = () => {
  const [section1Open, setSection1Open] = useState(false);
  const [section2Open, setSection2Open] = useState(false);

  const toggleSection1 = () => {
    setSection1Open(!section1Open);
  };

  const toggleSection2 = () => {
    setSection2Open(!section2Open);
  };

  return (
    <div className={styles.faqContainer}>
      <h1 className={styles.header}>Frequently Asked Questions</h1>
      <a href='./' className={styles.link}>
        Повернутися на головну
      </a>
      <div className={styles.sectionsContainer}>
        <div className={styles.section}>
          <div className={styles.sectionHeader} onClick={toggleSection1}>
            <h2>Як допомогти зі зборами</h2>
            <span
              className={`${styles.arrow} ${section1Open ? styles.open : ''}`}
            >
              ▶
            </span>
          </div>
          <div
            className={`${styles.sectionContent} ${
              section1Open ? styles.open : ''
            }`}
          >
            <header>
              <h1>Як допомогти зі зборами</h1>
            </header>

            <section>
              <h2>У якості вступу</h2>
              <p>
                Найголовніше - не варто хвилюватись стосовно того, що ти не
                зможеш зібрати потрібну суму та підведеш когось. Це не так, не
                підведеш. Щоб зупинити війну, нам потрібно об’єднатись і разом
                вирішувати цю проблему. Тому ми не очікуємо чудес від себе і не
                хочемо, щоби ти ставив перед собою таку мету. Важлива будь-яка
                допомога, чи це 100 гривень, чи це 100к. І оскільки ми всі
                приймаємо участь у зборі - ми його обов’язково виконаємо! 🤘
              </p>
            </section>

            <section>
              <h2>Що робити</h2>
              <ul>
                <li>
                  Що потрібно зробити в першу чергу - це визначитися з обсягами
                  збору. Це має бути комфортна для тебе сума. Необов'язково
                  починати з великої, т.к. ми збираємо не лише завдяки розмірам,
                  але й кількості донатерів.
                </li>
                <li>
                  Тобі потрібно створити банку в Монобанку, яку ти
                  використовуватимеш для збору. Чому не використовувати вже
                  існуючу, когось із Корчівників? Відповідь проста - можна, але
                  кількість зібраних грошей може скоротитися тому, що твої друзі
                  та знайомі кидатимуть не на твій особистий збір, а на чийсь.
                </li>
                <li>
                  Ми радимо робити збір якомога особистішим, персоналізованішим.
                  Коли є можливість - викласти фотографії військових, розповісти
                  їхню історію, показати відео з ними. Всі матеріали та історії
                  ми дамо.
                </li>
              </ul>
            </section>

            <section>
              <h2>Лайфхак</h2>
              <p>
                Це збільшує прозорість збору – гроші йдуть не до бригади
                ССО-ТрО-ГУР-МО “Дніпро”, умовної в якій багато людей і яка воює
                всюди, а конкретним хлопцям з конкретними вимогами.
              </p>
            </section>

            <section>
              <h2>Підсумуємо</h2>
              <ul>
                <li>Комфортна сума збору</li>
                <li>Своя банка</li>
                <li>Історія</li>
              </ul>
              <p>
                Ці три прості речі перетворять збір із однієї фотографії в
                інстаграмі з посиланням на чиюсь банку, на цілу історію про
                крутих бійців, їхні подвиги та прохання їм допомогти. Погодься,
                таким допомагати значно цікавіше.
              </p>
              <p>
                Є ще один момент - подібний контент значно цікавіший для читача.
                Його будуть читати, він отримає значно більше уваги.
              </p>
            </section>

            <section>
              <h2>Як збирати? Яка стратегія?</h2>
              <ul>
                <li>
                  Обери комфортний для себе спосіб - інстаграм, робочі чати,
                  телеграм канал та т.і.
                </li>
                <li>
                  За один день навряд вийде закрити збір. Доводиться постійно
                  нагадувати про збір, якось привертати увагу донатерів. Це
                  блогінг фактично. Але із реальною користю.
                </li>
                <li>
                  Не варто ображатися на своїх підписників чи донатерів. Вони
                  донатять по можливості. І в жодному разі не треба бути
                  токсичним - тиснути на почуття провини або страху
                  повідомленнями типу: "
                  <span class='highlight'>
                    Кожного дня якого ви не донатите, ви кличете росіян
                    знищувати наші будинки
                  </span>
                  ". Провина нікому не подобається, а страху в суспільстві і так
                  надміру, просто до нього вже всі якось пристосувалися.
                </li>
              </ul>
            </section>

            <section>
              <h2>Зібрали, що далі?</h2>
              <p>
                Коли ми підготуємо автомобіль, ми можемо покликати тебе на
                фінальну фотосесію. Потім цю фотку можна буде показати і сказати
                своїм донатерам щось типу "ось ви назбирали на цю машину і вона
                їде туди". Фотку передачі потім скинемо бійцям ми теж скинемо.
              </p>
              <p>
                Якщо будуть якісь питання - не соромся питати в чаті. Немає
                дурних питань. :)
              </p>
            </section>

            <section>
              <h2>Добре. А як ви обираєте авто?</h2>
              <p>
                Почнемо з найголовнішого - ми не пригоняємо авто з Європи.
                Замість цього ми вже давно співпрацюємо з авто-волонтером Натою
                Родиновою. Вона бере на себе пошук та доставку до Києва. В той
                момент коли машина приїзджає до столиці, ми відвозимо її на СТО
                - Hunters Garage.
              </p>
              <p>
                <span class='highlight'>
                  Стоп-стоп. Хантерс? Але ж це дорого!
                </span>
              </p>
              <p>
                Після цього на СТО оглядають машину та рахують вартість її
                ремонту. Якщо все добре - ми беремо його в роботу та оплачуємо.
                Якщо стан нас не задовольний - ми повертаємо його. Дякуємо Наті
                за цю можливість.
              </p>
            </section>

            <section>
              <h2>А як ви віддаєте авто військовим?</h2>
              <p>
                По акту приймання-передачі від фонду на військового або на
                військову частину.
              </p>
            </section>

            <section>
              <h2>Як ви обираєте військових?</h2>
              <p>
                Головне правило - ми повинні бути впевнені, що машина поїде
                служити та буде корисною. Також, для нас важливо розуміння того,
                що люди будуть ставитися до авто належним чином. Якщо ми
                впевнені у цих речах - ми додаємо запит у чергу.
              </p>
              <p>
                Також слід зауважити, що запити з більш гарячіших ділянок фронту
                мають перевагу над тими, які з менш гарячіших. Так само як
                підрозділи та ланки ЗСУ/ГУР без автомобілів у порівнянні з тими,
                де є хоч якесь авто.
              </p>
            </section>

            <section>
              <h2>А я можу додати когось у чергу? Які вимоги?</h2>
              <p>
                Так, можете. Напишіть одному з команди Корчівників і далі вже
                будемо вирішувати у діалозі. Плюс ви дізнаєтесь скільки машин у
                черзі та зможете вирішити чи можете ви стільки чекати. Але
                звичайно черга розписана на місяць-два у майбутнє.
              </p>
              <h2>А якщо у хлопців є машина але вони бажають її замінити?</h2>
              <p>
                Якщо машина у прийнятному стані - чому ні? Треба дивитись та
                обговорювати. Пишіть, спробуємо допомогти.
              </p>
            </section>
            <a href='./' className={styles.link}>
              Повернутися на головну
            </a>
          </div>
        </div>
        <div className={styles.section}>
          <div className={styles.sectionHeader} onClick={toggleSection2}>
            <h2>Наша допомога волонтерам та військовим</h2>
            <span
              className={`${styles.arrow} ${section2Open ? styles.open : ''}`}
            >
              ▶
            </span>
          </div>
          <div
            className={`${styles.sectionContent} ${
              section2Open ? styles.open : ''
            }`}
          >
            <h1>Наша допомога волонтерам та військовим</h1>
            <h2>Допомога у пошуку, купівлі, ремонту автомобіля</h2>
            <p>В нас є декілька умов по яким ми працюємо:</p>
            <ul>
              <li>
                🫙 <strong>Завдаток.</strong> Іноді ми його просимо. Він є
                гарантією, що ви не передумаєте поки ми шукаємо вам авто. Він
                знаходиться на банці, ви його постійно бачите. Якщо ваші плани
                всеж таки зміняться - ми вам його легко повернемо.
              </li>
              <li>
                🗺️{' '}
                <strong>
                  Ми повинні знати на який напрям та кому їде авто.
                </strong>{' '}
                Ми волонтери та відповідаємо своєю репутацією. Сподіваємось ви
                розумієте. При цьому немає необхідності казати роту, батальйон,
                номер управління у складі ГУР. Вистачить загальної інформації.
                Плюс по вашому запиту ми не будемо афішувати цю інформацію.
              </li>
              <li>
                🪪{' '}
                <strong>
                  Фонд буде передавати авто по акту або на бійця, або на ВЧ.
                </strong>{' '}
                Якщо на бійця - нам буде необхідне фото його військового квитка.
              </li>
              <li>
                📺 <strong>Ми будемо публічно звітувати про ваше авто.</strong>{' '}
                Можемо при цьому закривати номер машини.
              </li>
              <li>
                📸 <strong>Ну і з вас фотки з бійцями 🙂</strong> Нам також
                приємно бачити як результати волонтерської діяльності
                допомагають захищати країну.
              </li>
            </ul>
            <h2>Ось як ми працюємо:</h2>
            <p>
              Ми можемо попросити внести задаток на одну з наших банок. Зазвичай
              це десь 30% від планованої вартості авто. Він нам потрібен як
              гарантія того, що поки ми будемо чекати та перевіряти авто, ви не
              передумаєте та не забудете нам про це повідомити. А ми про це
              дізнаємось в останній момент вже маючи авто на руках.
            </p>
            <p>
              Ми не шукаємо авто в Європі самостійно та не завозимо їх в
              Україну. Замість цього, ми знаємо крутих волонтерів які нам
              допомагають з цим. Тож ми звернемось до них із запитом на авто.
            </p>
            <p>
              Коли воно знайдено і заїхало в Україну, ми направляємо його на СТО
              де його перевіряють.
            </p>
            <p>
              Якщо авто в поганому стані чи ремонт буде коштувати дуже дорого -
              ми можемо його повернути. В такому випадку ми вам повідомимо про
              це.
            </p>
            <p>
              Якщо все ок і авто можна брати, ми погодимо з вами розрахунок
              вартості ремонту. Також на цьому етапі, якщо у вас буде бажання,
              ви можете приїхати та подивитись авто самостійно.
            </p>
            <p>
              Якщо все ок - ви сплачуєте вартість авто, а ми починаємо ремонт.
            </p>
            <p>
              Коли ремонт закінчено, ви сплачуєте його вартість напряму СТО і ми
              забираємо авто.
            </p>
            <p>
              Після цього, за потреби, ми віддамо його на фарбування,
              встановлення багажнику, люстри тощо.
            </p>
            <p>
              Після закінчення всіх робот ми обкатуємо авто і за потреби робимо
              додатковий ремонт. Перелік робот та їх вартість ми погодимо з
              вами.
            </p>
            <p>
              Після закінчення всіх робот ми можемо привезти авто до військових,
              якщо у вас не буде бажання самостійно цим займатись. Ну або
              поїдете з нами. 🙂
            </p>
            <h2>Також є ризики які важливо мати на увазі</h2>
            <p>
              Важливо розуміти, що ми беремо старе цивільне авто, ремонтуємо та
              відправляємо на фронт. На фронті воно буде їздити інколи на досить
              великій швидкості, по вбитих дорогах та бездоріжжю, іноді
              перевантажене, іноді у ситуаціях коли обережне водіння взагалі не
              пріоритет.
            </p>
            <p>
              І як ви вже зрозуміли в нас є декілька стадій контролю якості
              авто:
            </p>
            <ul>
              <li>Перед купівлею</li>
              <li>Обкатка після ремонту</li>
              <li>Дорога на схід, це десь 700км+</li>
            </ul>
            <p>
              Ми робимо все, що в наших силах, щоб виявити слабкі місця до
              моменту передачі авто бійцям.
            </p>
            <p>
              Проте нажаль іноді буває, що машина по приїзду може зламатись
              раніше, ніж нам би хотілося. І ми не можемо та не надаємо жодних
              гарантій стосовно авто. Повірте, нам також це дуже неприємно, але
              ми повторимо тому що дуже важливо це розуміти - це старі авто, в
              яких іноді бувають сюрпризи, які вилазять запізно.
            </p>
            <p>
              Відверто кажучи, людина яка вам дає такі гарантії - розповідає вам
              те, що ви хочете чути. 😉
            </p>
            <p>
              Але в таких ситуаціях ми не відвертаємось від бійців та
              намагаємось допомагати. Ми не зникаємо, ми сконтактуємо з людьми
              що робили ремонт, за потреби, ми можемо допомогти у пошуку
              запчастин, тощо.
            </p>
            <h2>Допомога з евакуацією</h2>
            <p>
              Також ми можемо евакуювати ваше авто зі сходу та довезти його по
              Україні до Києва, Харкова, Дніпра, тощо. Також, ми можемо потім
              допомогти з діагностикою та ремонтом цієї машини.
            </p>
            <p>Але майте на увазі дві речі:</p>
            <ul>
              <li>Для цього ваше авто має мати документи 🙂</li>
              <li>
                У більшості випадків ми будемо синхронізувати евакуацію з нашими
                поїздками
              </li>
            </ul>
            <p>За потреби ми можемо взяти в оренду лафет.</p>
            <h2>Ваші наступні кроки</h2>
            <p>Пишіть будь-кому із нас.</p>
            <p>
              Або в нашу інсту{' '}
              <a
                href='https://www.instagram.com/korchivnyky'
                target='_blank'
                rel='noopener noreferrer'
              >
                https://www.instagram.com/korchivnyky
              </a>
            </p>
            <a href='./' className={styles.link}>
              Повернутися на головну
            </a>
          </div>
        </div>
      </div>
    </div>
  );
};

export default FAQ;
